[[["08339ac0-dedb-4892-af68-1f4af5d93691",{"pageContent":"Questions:\r\nWhat is NEO App \r\nWhat is the concept of NEO app? \r\nWhat does NEO app do? \r\nWhat is NEO? \r\n\r\nAnswer: \r\nanb capital App (NEO) is an enhanced, user-friendly and easy to navigate interface that effortlessly connects you to the Saudi Exchange and to our dynamic mutual funds. Experience a new era of trading excellence. \r\nThis App will keep you in touch with the ever-changing financial markets and put decision-taking and order-placing ability at your fingertips. \r\nMonitor the markets and your positions, catch up on the latest news. Open your online trading account today and start trading the main and Nomu Saudi Exchange markets. \r\nNEO App gives you all the features you need to trade in the Saudi Market. Trade your way with ANB Capital and react quickly to every opportunity. Trade directly from your Smartphone or Web. \r\n\r\nLink to download App: \r\nhttps://play.google.com/store/apps/details?id=com.directfn.mobile.anb_prod&hl=en \r\n\r\n\r\nFounders \r\nWho built the NEO app?","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":3,"to":20}}}}],["bfcde912-6f54-4fd6-972a-860f2b618886",{"pageContent":"Link to download App: \r\nhttps://play.google.com/store/apps/details?id=com.directfn.mobile.anb_prod&hl=en \r\n\r\n\r\nFounders \r\nWho built the NEO app? \r\nWho is behind NEO app? \r\nWho developed the NEO app? \r\nWho owns NEO app? \r\nWhich company built NEO app? \r\nBackground of NEO app \r\nAuthenticity of NEO \r\n\r\nAnswer: \r\nNEO was built by a Saudi based company called 'DirectFN ' which is an award winning & industry leading Capital Market Solutions Provider, which lifts capital markets by outpacing the advancing financial technology landscape transparently. \r\n\r\nDirectFN is an Innovative Financial Technology solutions provider having top of the line 20 years of expertise and skills in software development specialized in Capital Markets. With two dedicated development centers for delivering an end-end solution. \r\n\r\nDirectFN is CMMi (Capability Maturity Model Integration) Level 3 certified from CMMi Institute","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":15,"to":33}}}}],["37279aa5-a136-4f32-a479-a719670fb084",{"pageContent":"DirectFN is CMMi (Capability Maturity Model Integration) Level 3 certified from CMMi Institute \r\n\r\nDirectFN Development Centers are progressing the path of process level improvement training and appraisal program of CMMI (Capability Maturity Model Integration) \r\n\r\nSpecialty \r\nWhat outstands NEO app from other trading app? \r\nWhat highlights NEO app? \r\nWhat is special about NEO app? \r\n\r\nAnswer:  \r\nEnhanced UI/UX - user-friendly and easy to navigate interface \r\nEffortless connectivity to the Saudi Exchange and to dynamic mutual funds \r\nEnhanced and advanced trading features - Conditional orders, Auto invest \r\nSeamless account opening - Easy and quick account opening process \r\nIf you're vibrant, you're on the move, and you expect excellence.   \r\nThat is why we designed our app to match your aspirations. \r\nDownload our app today and begin your journey to growing your portfolio over the long term.   \r\nWe welcome you to the new standard in Saudi brokerage. \r\n\r\nMain features","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":33,"to":52}}}}],["779eecb9-34c1-4cd5-8001-54ff48db83af",{"pageContent":"Download our app today and begin your journey to growing your portfolio over the long term.   \r\nWe welcome you to the new standard in Saudi brokerage. \r\n\r\nMain features \r\nWhat are the key features of NEO app? \r\nWhat promotes NEO app? \r\nWhat are the key features of NEO app? \r\nWhy we should use NEO app? \r\n\r\nAnswer:  \r\nEasy access to portfolio information \r\nSimple swipes and scrolls will get you to all the information you want to see about your portfolio. \r\nAutomated investing \r\nSchedule your investment orders in advance for any day, week, or month for a predetermined period. \r\nDynamic watchlists \r\nCreate specialized watchlists for Shariah-compliant stocks or newly listed stocks or growth stocks or ESG stocks.  Monitor market dynamics and track the performance of your favorite stocks. Or simply follow our watchlists, especially curated to keep you informed about investment themes and trends. \r\nAnalyst ratings","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":49,"to":65}}}}],["83cf37f8-433a-4f41-8254-96dd696a63b8",{"pageContent":"Analyst ratings \r\nAccess news and information about Saudi listed companies including analyst ratings and recommendations. \r\nMargin financings \r\nRequest margin financing within the app to enhance your stock buying power. \r\nSwitch to Global Trading at a flick \r\nSwitch over into our global trading platform with a single tap. Our global trading app is your gateway to the world, connecting you to GCC and international markets effortlessly. \r\nA Visual Treat \r\nThe app is especially designed to be easy on your eyes. We created the screens for you to enjoy your trading experience. \r\n\r\nApplication customizations \r\nCan I customize NEO application? \r\nCan I customize my user profile? \r\n\r\nAnswer:  \r\n\r\nNEO application provides many customizations in the application level,  \r\nTrading view dashboard \r\nWatchlist customization  \r\nTwo themes supported (Light mode and Dark mode) \r\nMulti language support (Arabic and English)","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":65,"to":84}}}}],["330f2ee2-89e5-421e-955f-ecaff9644181",{"pageContent":"Trading view dashboard \r\nWatchlist customization  \r\nTwo themes supported (Light mode and Dark mode) \r\nMulti language support (Arabic and English) \r\nAlso, NEO app provides User profile editing, where in the User can update his personal information such as email, mobile number, notification preference language. \r\nAdditionally, he/she can edit/change their profile picture \r\n\r\nNEO app news and promotions \r\nCan I use NEO app as an information source? \r\n\r\nAnswer:  \r\nNEO app provides news and announcements related to the Saudi stock market or related to the symbol/company. \r\nSymbol news delivers timely updates and articles specifically related to a chosen financial symbol or asset. It keeps users informed about news, events, and developments that impact the chosen symbol, providing insights to aid in informed decision-making for investors.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":81,"to":93}}}}],["7203b7fe-446b-4e4b-a1ba-ba4e94b526e3",{"pageContent":"Market news provides users with the latest updates and articles covering relevant financial news and market trends. It delivers insights into global economic events, company announcements, sector-specific developments, and analysis from financial experts, enabling users to stay informed and make informed decisions in their investment strategies. \r\nWhereas the Promotions widget showcases special offers, discounts, and events to enhance the trading experience. It provides information on deals like reduced fees, bonus credits, and free trades, as well as upcoming events. The widget personalizes promotions based on user behavior, highlights partner benefits, and alerts users about expiring offers, ensuring they capitalize on valuable opportunities. \r\n\r\nIs there a single widget consisting of all the trading related widgets? \r\nAnswer: \r\nNeo app trading configuration enabled, \"One view\" provides User with all trade-related widget views in a single screen as a dashboard.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":94,"to":99}}}}],["f89481a7-4a22-4a2e-bbd9-0c5abe2d692d",{"pageContent":"Answer: \r\nNeo app trading configuration enabled, \"One view\" provides User with all trade-related widget views in a single screen as a dashboard. \r\nThis view facilitates the user with Portfolio information, Watchlists, Order list and Quick Trade order ticket \r\nUsers can enable or disable the \"One view\" just by swiping a toggle. \r\n\r\n\r\n\r\nQuestion: List down some trading applications\r\nAnswer: We offer Neo Trading App to trade and view stocks. Please refer some internet resource to view about other trading applications.\r\n\r\nQuestion: Suggest number of trading applications\r\nAnswer: We offer Neo Trading App to trade and view stocks. Please refer some internet resource to view about other trading applications.\r\n\r\nQuestion: Comparison with Other Trading Applications\r\nAnswer: We offer Neo Trading App to trade and view stocks. Please refer some internet resource to view about other trading applications.\r\n\r\nQuestion: Is there any other trading applications like neo?","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":98,"to":114}}}}],["5d2906d0-6661-477c-89ed-a9068a377e0d",{"pageContent":"Question: Is there any other trading applications like neo?\r\nAnswer: We offer Neo Trading App to trade and view stocks. Please refer some internet resource to view about other trading applications.\r\n\r\nQuestion: give Trading Applications Similar to Neo\r\nAnswer: We offer Neo Trading App to trade and view stocks. Please refer some internet resource to view about other trading applications.\r\n\r\n\r\nWidget Navigations\r\n\r\nName: Promotions\r\nPath: Home > Promotion\r\nAbout: The Promotions widget in the Neo trading application showcases special offers, discounts, and events to enhance the trading experience. It provides information on deals like reduced fees, bonus credits, and free trades, as well as upcoming events. The widget personalizes promotions based on user behaviour, highlights partner benefits, and alerts users about expiring offers, ensuring they capitalize on valuable opportunities.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":114,"to":125}}}}],["4a527bb9-61ae-4498-abf0-997290e5a194",{"pageContent":"Included Content: discount, offer, special, deal, limited-time, save, exclusive, new, launch, bonus, reward, gift, free, trial, membership, upgrade, discount code, VIP, promotion, benefit, savings\r\nLink to open, view or navigate: btn://home/promotion\r\nTool: btn://home/promotion\r\n\r\nName: Notifications\r\nPath: Home > Welcome banner\r\nAbout: The Notification widget keeps users informed about important updates, alerts, and reminders. It ensures timely communication regarding account activity, system changes, and promotional messages.\r\nIncluded Content: alert, update, reminder, notification, message, warning, maintenance, account, activity, security, change, new feature, update, action required, critical, announcement, application update\r\nLink to open, view or navigate: btn://home/welcome banner\r\nTool: btn://home/welcome banner\r\n\r\nName: Account Summary\r\nPath: Home > Carousel","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":126,"to":138}}}}],["4cb3b8c0-0aaa-4490-a386-f8014cf809ee",{"pageContent":"Link to open, view or navigate: btn://home/welcome banner\r\nTool: btn://home/welcome banner\r\n\r\nName: Account Summary\r\nPath: Home > Carousel\r\nAbout: The Account Summary widget provides users with a concise overview of their account details, including balances, transaction history, and account status. It offers a quick glance at financial information of theirs and helps them monitor their account activity efficiently.\r\nIncluded Content: balance, transaction, history, statement, overview, summary, account, details, current balance, available balance, pending transactions, recent activity, deposits, withdrawals, credits, debits\r\nLink to open, view or navigate: btn://home/carousel\r\nTool: btn://home/carousel\r\n\r\nName: Auto Invest\r\nPath: Home","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":134,"to":145}}}}],["11987310-4b63-4e84-a339-252d4b4ec700",{"pageContent":"Link to open, view or navigate: btn://home/carousel\r\nTool: btn://home/carousel\r\n\r\nName: Auto Invest\r\nPath: Home\r\nAbout: The Auto Invest widget enables users to automate their investment strategies effortlessly. It simplifies the process of investing by allowing users to set predefined criteria for automatic investments, such as amount, frequency, and target assets.\r\nIncluded Content: automate, investment, predefined, criteria, amount, frequency, asset, portfolio, scheduled investments, recurring investments, automatic\r\nLink to open, view or navigate: btn://home\r\nTool: btn://home\r\n\r\nName: Trade Global\r\nPath: Home\r\nAbout: The Trade Global widget empowers users to engage in global trading activities with ease. It facilitates seamless transactions across international markets, providing access to diverse investment opportunities and real-time market updates.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":141,"to":153}}}}],["0440bed3-18c9-40ed-8afe-3d37fdb65a03",{"pageContent":"Included Content: global trading, international markets, investment opportunities, transactions, real-time updates, forex, stocks, commodities, indices\r\nLink to open, view or navigate: btn://home\r\nTool: btn://home\r\n\r\nName: Full Market Watch\r\nPath: Explore > Popular Lists\r\nAbout: The Full Market Watch widget provides users with comprehensive real-time updates and insights across various financial markets. It allows users to monitor a wide range of assets, including stocks, commodities, and indices, facilitating informed investment decisions.\r\nIncluded Content: real-time updates, financial markets, stocks, commodities, indices, asset monitoring, investment decisions, market trends, price movements\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Favourite WLs or Watchlists\r\nPath: Explore > Popular Lists","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":154,"to":166}}}}],["ab32b031-63a1-4617-8051-107ab2906edf",{"pageContent":"Link to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Favourite WLs or Watchlists\r\nPath: Explore > Popular Lists\r\nAbout: The Favorite Watchlists widget allows users to curate and monitor personalized lists of favorite assets or investments. It enables users to track performance, receive updates, and stay informed about changes/updates that matter most to them.\r\nIncluded Content: curate, personalized lists, favorite assets, investments, track performance, financial instruments\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Mutual Funds\r\nPath: Explore > Popular Lists\r\nAbout: The Mutual Funds widget provides users with convenient access to information and updates on mutual fund investments. It helps users explore various mutual fund options, track performance, and make informed decisions based on fund details and historical data.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":162,"to":174}}}}],["5c0bc7cd-8690-4f91-bb72-4a22607cd25e",{"pageContent":"Included Content: mutual funds, investment options, fund details, historical data, NAV (Net Asset Value), expense ratio\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Daily Movers\r\nPath: Explore > Popular Lists\r\nAbout: The Daily Movers widget highlights assets that have shown significant price movements or trading volume changes within a single trading day. It provides users with real-time updates on market movers, helping them identify trends and potential opportunities quickly.\r\nIncluded Content: price movements, volume changes, market movers, trends, daily movers\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Top Movers\r\nPath: Explore > Popular Lists","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":175,"to":187}}}}],["19c756a7-d068-46af-9c34-2a49b76d35bf",{"pageContent":"Link to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Top Movers\r\nPath: Explore > Popular Lists\r\nAbout: The Top Movers widget showcases assets that have experienced the most significant price changes or trading volume fluctuations recently. It helps users stay updated on market dynamics and identify assets that are trending or experiencing notable activity.\r\nIncluded Content: significant price changes, trading volume fluctuations, active trading, recent movements\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Top Losers\r\nPath: Explore > Popular Lists\r\nAbout: The Top Losers widget displays assets that have shown the most significant declines in price or trading volume over a recent period. It provides users with insights into assets experiencing downward trends, helping them stay informed about market movements.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":183,"to":195}}}}],["0820c89e-90bf-46d9-8a4c-0c3c17df0cf4",{"pageContent":"Included Content: significant declines, price drops, trading volume decreases, downward movement\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Top Gainers\r\nPath: Explore > Popular Lists\r\nAbout: The Top Gainers widget highlights assets that have experienced the most significant increases in price or trading volume recently. It allows users to quickly identify assets showing upward momentum, providing insights into trending opportunities in the market.\r\nIncluded Content: significant price increases, trading volume surges, upward momentum, market trends\r\nLink to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Index (Detailed)\r\nPath: Home/Explore","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":196,"to":208}}}}],["a68fda8d-22fa-41e4-9184-2566ccfad0a8",{"pageContent":"Link to open, view or navigate: btn://explore/popular lists\r\nTool: btn://explore/popular lists\r\n\r\nName: Index (Detailed)\r\nPath: Home/Explore\r\nAbout: The Index (Detailed) widget provides users with in-depth information and updates on specific financial indices. It offers comprehensive insights into index performance, and sector breakdowns, enabling informed decision-making about market trends.\r\nIncluded Content: financial indices, index performance, sector breakdowns\r\nLink to open, view or navigate: btn://home/explore\r\nTool: btn://home/explore\r\n\r\nName: About Index\r\nPath: Home/Explore > Index\r\nAbout: The About Index widget offers users detailed information and insights into specific financial indices. It provides key details such as index composition, sector weightings, and current trends, empowering informed decision-making in the context of market analysis.\r\nIncluded Content: index composition, sector weightings, market analysis","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":204,"to":217}}}}],["2f50da48-36ca-45ec-bd8e-c9501e175b8c",{"pageContent":"Included Content: index composition, sector weightings, market analysis\r\nLink to open, view or navigate: btn://home/explore/index\r\nTool: btn://home/explore/index\r\n\r\nName: Statistics\r\nPath: Home/Explore > Index\r\nAbout: The Statistics widget provides users with essential numerical data and metrics relevant to their financial analysis. It offers key statistics such as market performance indicators, historical trends, volatility measures, correlation coefficients, and other quantitative insights, facilitating informed decision-making in investment strategies.\r\nIncluded Content: numerical data, market performance indicators, quantitative insights\r\nLink to open, view or navigate: btn://home/explore/index\r\nTool: btn://home/explore/index\r\n\r\nName: Market News\r\nPath: Explore","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":217,"to":229}}}}],["242f3c19-5d17-46ee-b74d-7bf8fef10719",{"pageContent":"Link to open, view or navigate: btn://home/explore/index\r\nTool: btn://home/explore/index\r\n\r\nName: Market News\r\nPath: Explore\r\nAbout: The Market News widget provides users with the latest updates and articles covering relevant financial news and market trends. It delivers insights into global economic events, company announcements, sector-specific developments, and analysis from financial experts, enabling users to stay informed and make informed decisions in their investment strategies.\r\nIncluded Content: latest updates, financial news, market trends, global economic events, company announcements, sector-specific developments\r\nLink to open, view or navigate: btn://explore\r\nTool: btn://explore\r\n\r\nName: Curated WLs\r\nPath: Watchlists","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":225,"to":236}}}}],["c2df620f-27a0-4a06-ab94-e2610d7ea920",{"pageContent":"Link to open, view or navigate: btn://explore\r\nTool: btn://explore\r\n\r\nName: Curated WLs\r\nPath: Watchlists\r\nAbout: The Curated Watchlists widget allows users to access and monitor meticulously selected lists of assets or investments. It provides a curated selection based on specific criteria such as performance, sector, or user preferences, helping users track relevant assets and make informed decisions in their investment strategies.\r\nIncluded Content: meticulously selected lists, assets, curated selection, sector, user preferences\r\nLink to open, view or navigate: btn://watchlists\r\nTool: btn://watchlists\r\n\r\nName: Symbol (Detailed)\r\nPath: Symbol list","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":232,"to":243}}}}],["8f2222ba-c3a4-4d56-957a-a6f14c8cf497",{"pageContent":"Link to open, view or navigate: btn://watchlists\r\nTool: btn://watchlists\r\n\r\nName: Symbol (Detailed)\r\nPath: Symbol list\r\nAbout: The Symbol (Detailed) widget provides users with comprehensive details and insights into specific financial symbols or assets. It offers in-depth information such as current prices, historical performance, trading volumes, and company fundamentals, empowering users to conduct thorough analysis and make informed investment decisions.\r\nIncluded Content: comprehensive details, insights, specific financial symbols, assets, current price, historical performance, trading volumes, company fundamentals\r\nLink to open, view or navigate: btn://symbol list\r\nTool: btn://symbol list\r\n\r\nName: About Symbol\r\nPath: Symbol list > Symbol details\r\nAbout: The About Symbol widget offers users detailed information and insights into specific financial symbols or assets. It provides essential details such as symbol description and company background","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":239,"to":251}}}}],["346b7136-18d6-4bf1-bfcb-63da8efaf918",{"pageContent":"Included Content: detailed information, insights, specific financial symbols, symbol information, company background\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Statistics\r\nPath: Symbol list > Symbol details\r\nAbout: The Statistics widget provides users with essential numerical data and metrics relevant to a particular Symbol. It offers key statistics such as market performance indicators, and other important quantitative insights\r\nIncluded Content: numerical data, market performance indicators, quantitative insights\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Market Depth\r\nPath: Symbol list > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":252,"to":264}}}}],["506cdd1e-c6de-4450-8178-c7e24e36cf12",{"pageContent":"Link to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Market Depth\r\nPath: Symbol list > Symbol details\r\nAbout: The Market Depth widget displays real-time information about the buy and sell orders for a specific asset or financial instrument. It provides insights into the current market liquidity, order book dynamics, price levels with corresponding volumes, and helps traders assess market sentiment and potential price movements.\r\nIncluded Content: real-time information, market liquidity, order book dynamics, price levels, volumes, market sentiment\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Time and Sales\r\nPath: Symbol list > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":260,"to":271}}}}],["d951443b-b8ae-45f1-9d7f-4b3d3f138d29",{"pageContent":"Link to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Time and Sales\r\nPath: Symbol list > Symbol details\r\nAbout: The Time and Sales widget provides users with detailed transaction data for a specific asset or financial instrument in real-time. It displays information such as trade prices, volumes, timestamps offering insights into market activity and helping traders make informed decisions based on transaction history.\r\nIncluded Content: transaction data, real-time updates, trade prices, volumes, timestamps\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Symbol News\r\nPath: Symbol list > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":267,"to":278}}}}],["00945749-fa31-4ac5-a3d0-57085773820a",{"pageContent":"Link to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Symbol News\r\nPath: Symbol list > Symbol details\r\nAbout: The Symbol News widget delivers timely updates and articles specifically related to a chosen financial symbol or asset. It keeps users informed about news, events, and developments that impact the chosen symbol, providing insights to aid in informed decision-making for investors.\r\nIncluded Content: timely updates, financial symbol news, symbol updates, impact analysis\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Earnings\r\nPath: Symbol list > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":274,"to":285}}}}],["8650e9c4-c38b-48be-afb8-e9fe1e3c9071",{"pageContent":"Link to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Earnings\r\nPath: Symbol list > Symbol details\r\nAbout: The Earnings widget provides users with updates and insights into earnings reports and the financial performance of companies. It offers information such as earnings per share (EPS), revenue figures, profit margins, and guidance, helping investors stay informed about corporate earnings and make informed decisions based on financial results.\r\nIncluded Content: earnings reports, financial performance, earnings per share (EPS), profit margins, earning opinion\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Related Stocks\r\nPath: Symbol list > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":281,"to":292}}}}],["039483b2-b38b-4dba-a3b3-73e5636c358a",{"pageContent":"Link to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Related Stocks\r\nPath: Symbol list > Symbol details\r\nAbout: The Related Stocks widget helps users discover and explore stocks that are related to a specific sector. It provides suggestions based on similarities in industry, market segment, or other relevant criteria, facilitating broader research and investment decision-making.\r\nIncluded Content: discover stocks, explore related stocks, industry similarities, investment research\r\nLink to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Your Positions\r\nPath: Home > Stock holdings > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":288,"to":299}}}}],["8ed61a4a-01a3-4a42-bf20-050d1eff5e8a",{"pageContent":"Link to open, view or navigate: btn://symbol list/symbol details\r\nTool: btn://symbol list/symbol details\r\n\r\nName: Your Positions\r\nPath: Home > Stock holdings > Symbol details\r\nAbout: The Your Positions widget displays information about the assets or investments currently held in a user's portfolio. It provides details such as asset names, quantities held, current market values, and performance metrics, allowing users to track their positions and monitor portfolio performance effectively.\r\nIncluded Content: portfolio holdings, asset details, quantities held, current market values, performance metrics\r\nLink to open, view or navigate: btn://home/stock holdings > symbol details\r\nTool: btn://home/stock holdings > symbol details\r\n\r\nName: Your Recent Activity\r\nPath: Home > Stock holdings > Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":295,"to":306}}}}],["1def5eb8-2646-4a7c-9b1d-7429547d0c02",{"pageContent":"Tool: btn://home/stock holdings > symbol details\r\n\r\nName: Your Recent Activity\r\nPath: Home > Stock holdings > Symbol details\r\nAbout: The Your Recent Activity widget shows users a summary of their recent interactions or transactions within the application. It provides details such as recent trades, account updates, deposits, withdrawals, or other relevant activities, enabling users to review recent actions and stay updated on account activities.\r\nIncluded Content: recent interactions, transactions summary, recent trades, deposits, withdrawals\r\nLink to open, view or navigate: btn://home/stock holdings > symbol details\r\nTool: btn://home/stock holdings > symbol details\r\n\r\nName: Buy Order Ticket\r\nPath: Quick menu/Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":303,"to":313}}}}],["248e1461-afb9-4c77-a775-b7b4f0da32ca",{"pageContent":"Link to open, view or navigate: btn://home/stock holdings > symbol details\r\nTool: btn://home/stock holdings > symbol details\r\n\r\nName: Buy Order Ticket\r\nPath: Quick menu/Symbol details\r\nAbout: The Buy Order Ticket widget facilitates users in placing purchase orders for assets or investments within the application. It allows users to specify details such as asset quantity, price, and order type (e.g., market or limit), enabling seamless execution of buying transactions.\r\nIncluded Content: Place orders, asset quantity, price, order type, market order, limit order\r\nLink to open, view or navigate: btn://quick menu/symbol details\r\nTool: btn://quick menu/symbol details\r\n\r\nName: Sell Order Ticket\r\nPath: Quick menu/Symbol details","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":309,"to":320}}}}],["d22d34de-9b8b-4f25-ab32-0f60c5d06132",{"pageContent":"Link to open, view or navigate: btn://quick menu/symbol details\r\nTool: btn://quick menu/symbol details\r\n\r\nName: Sell Order Ticket\r\nPath: Quick menu/Symbol details\r\nAbout: The Sell Order Ticket widget enables users to place sell orders for assets or investments directly within the application. It allows users to specify details such as asset quantity, price, and order type (e.g., market or limit), facilitating efficient execution of selling transactions.\r\nIncluded Content: sell orders, available quantity, offer price, order type, market order, limit order\r\nLink to open, view or navigate: btn://quick menu/symbol details\r\nTool: btn://quick menu/symbol details\r\n\r\nName: Advanced Order Settings\r\nPath: Order Ticket","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":316,"to":327}}}}],["e74cb8b6-e020-462e-bde3-310ab0cfd07b",{"pageContent":"Link to open, view or navigate: btn://quick menu/symbol details\r\nTool: btn://quick menu/symbol details\r\n\r\nName: Advanced Order Settings\r\nPath: Order Ticket\r\nAbout: The Advanced Order Settings widget empowers users to customize and set advanced parameters for their trading orders within the application. It allows users to define conditions such as stop-loss, take-profit, trailing stop, and order expiry, enhancing control and flexibility in executing trading strategies.\r\nIncluded Content: customize orders, advanced parameters, stop-loss, take-profit, trailing stop, order expiry\r\nLink to open, view or navigate: btn://order ticket\r\nTool: btn://order ticket\r\n\r\nName: Conditional Orders\r\nPath: Order Ticket","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":323,"to":334}}}}],["8b42d11f-63cf-431c-a74d-8a1ddd02a50c",{"pageContent":"Link to open, view or navigate: btn://order ticket\r\nTool: btn://order ticket\r\n\r\nName: Conditional Orders\r\nPath: Order Ticket\r\nAbout: The Conditional Orders widget allows users to set automated conditions for executing trading orders based on predefined criteria. It enables users to specify conditions such as price triggers, time frames, and order types (e.g., stop-loss, take-profit), providing flexibility and automation in managing investment positions.\r\nIncluded Content: automated conditions, trading orders, predefined criteria, price triggers, time frames, order types\r\nLink to open, view or navigate: btn://order ticket\r\nTool: btn://order ticket\r\n\r\nName: User Profile\r\nPath: More > My Account > User Profile","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":330,"to":341}}}}],["30a3622e-0204-4090-982a-3af00c560710",{"pageContent":"Link to open, view or navigate: btn://order ticket\r\nTool: btn://order ticket\r\n\r\nName: User Profile\r\nPath: More > My Account > User Profile\r\nAbout: The User Profile widget displays essential information about the user's account and settings within the application. It includes personal information, and notification preferences, change profile pictures, enabling users to manage and customize their experience effectively.\r\nIncluded Content: account details, personal information, personal preferences\r\nLink to open, view or navigate: btn://more/my account > user profile\r\nTool: btn://more/my account > user profile\r\n\r\nName: Edit Profile Picture\r\nPath: More > My Account > User Profile\r\nAbout: The Edit Profile Picture widget allows users to update their profile image within the application. It provides a simple interface to upload, crop, and set a new profile picture, ensuring users can personalize their account and enhance their user experience.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":337,"to":349}}}}],["d843da07-f958-4acd-b013-50847a1888eb",{"pageContent":"Included Content: update profile image, upload, crop, set profile picture\r\nLink to open, view or navigate: btn://more/my account > user profile\r\nTool: btn://more/my account > user profile\r\n\r\nName: Rights Subscription\r\nPath: More > My Account > Rights Subscription\r\nAbout: The Rights Subscription widget facilitates users in subscribing to rights offerings within the application. It allows users to review details such as subscription terms, and allocation options, ensuring seamless participation in rights issues.\r\nIncluded Content: rights offerings, subscription terms, allocation options\r\nLink to open, view or navigate: btn://more/my account > rights subscription\r\nTool: btn://more/my account > rights subscription\r\n\r\nName: Investment Accounts\r\nPath: More > My Account > Investment Accounts","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":350,"to":362}}}}],["e6191a67-d274-4f67-8c6d-92ada613a146",{"pageContent":"Tool: btn://more/my account > rights subscription\r\n\r\nName: Investment Accounts\r\nPath: More > My Account > Investment Accounts\r\nAbout: The Investment Accounts widget provides users with an overview of their various investment accounts within the application. It includes details such as account types, and balances, allowing users to transfer money between two investments effectively.\r\nIncluded Content: investment accounts, account types, balances, investment history\r\nLink to open, view or navigate: btn://more/my account > investment accounts\r\nTool: btn://more/my account > investment accounts\r\n\r\nName: Deposit Instructions\r\nPath: More > My Account > Investment Accounts\r\nAbout: The Deposit Instructions widget guides users on how to deposit funds into their accounts within the application. It provides step-by-step instructions, including payment methods, account details, and any necessary documentation, ensuring a smooth and secure deposit process.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":359,"to":370}}}}],["642a94a3-6eef-4e87-aa8a-0446a66dd572",{"pageContent":"Included Content: deposit funds, account details, step-by-step instructions\r\nLink to open, view or navigate: btn://more/my account > investment accounts\r\nTool: btn://more/my account > investment accounts\r\n\r\nName: Investment Account Transfer\r\nPath: More > Cash and Margin > Transfer >\r\nAbout: The Investment Account Transfer widget facilitates users in transferring their money between two investment accounts. It provides options to initiate transfers, specify the amount and Portfolio, and track transfer status, ensuring efficient management of investment portfolios.\r\nIncluded Content: transfer assets, investment accounts, track transfer status\r\nLink to open, view or navigate: btn://more/cash and margin > transfer >\r\nTool: btn://more/cash and margin > transfer >\r\n\r\nName: Inv. Acc. Transfer History\r\nPath: More > My Account > Investment Accounts >","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":371,"to":383}}}}],["6a3b9298-c7d1-4a3a-a82b-46bfabf5d120",{"pageContent":"Tool: btn://more/cash and margin > transfer >\r\n\r\nName: Inv. Acc. Transfer History\r\nPath: More > My Account > Investment Accounts >\r\nAbout: The Investment Account Transfer History widget provides users with a detailed record of all past transfers between their investment accounts within the application. It includes information such as dates, amounts, and transfer status, enabling users to review and track their transfer activities efficiently.\r\nIncluded Content: transfer history, past transfers, dates, amounts, transfer statuses, track transfers\r\nLink to open, view or navigate: btn://more/my account > investment accounts >\r\nTool: btn://more/my account > investment accounts >\r\n\r\nName: Bank Accounts\r\nPath: More > My Account > Bank Accounts\r\nAbout: The Bank Accounts widget displays users' linked bank accounts within the application. It provides details such as account numbers, account types, linked institutions","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":380,"to":391}}}}],["06e383a5-4717-4ae6-a794-d756feec4284",{"pageContent":"About: The Bank Accounts widget displays users' linked bank accounts within the application. It provides details such as account numbers, account types, linked institutions\r\nIncluded Content: linked bank accounts, account numbers, account types, linked institutions\r\nLink to open, view or navigate: btn://more/my account > bank accounts\r\nTool: btn://more/my account > bank accounts\r\n\r\nName: Add New Bank Account\r\nPath: More > My Account > Bank Accounts\r\nAbout: The Add New Bank Account widget allows users to securely add a new bank account to their profile. It guides users through the process of entering account details, and bank details, verifying information, and completing necessary security measures.\r\nIncluded Content: add new bank account, enter account details, verify information, complete security measures\r\nLink to open, view or navigate: btn://more/my account > bank accounts\r\nTool: btn://more/my account > bank accounts\r\n\r\nName: Update KYC\r\nPath: More > My Account > Update KYC","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":391,"to":404}}}}],["d1327b7c-3e8b-4c1c-974a-781861998950",{"pageContent":"Link to open, view or navigate: btn://more/my account > bank accounts\r\nTool: btn://more/my account > bank accounts\r\n\r\nName: Update KYC\r\nPath: More > My Account > Update KYC\r\nAbout: The Update KYC widget guides users through the process of updating their Know Your Customer (KYC) information within the application.\r\nIncluded Content: update KYC information, verify details, regulatory compliance\r\nLink to open, view or navigate: btn://more/my account > update kyc\r\nTool: btn://more/my account > update kyc\r\n\r\nName: Tadawulaty\r\nPath: More > My Account > Tadawulaty\r\nAbout: Navigate User to an external, to the Tadawulaty official site\r\nIncluded Content: Tadawulaty website\r\nLink to open, view or navigate: btn://more/my account > tadawulaty\r\nTool: btn://more/my account > tadawulaty\r\n\r\nName: Stock Statement\r\nPath: More > My Account > Stock Statement","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":400,"to":418}}}}],["06203f8f-c5c2-42f6-8a56-7b9301abf6a2",{"pageContent":"Link to open, view or navigate: btn://more/my account > tadawulaty\r\nTool: btn://more/my account > tadawulaty\r\n\r\nName: Stock Statement\r\nPath: More > My Account > Stock Statement\r\nAbout: The Stock Statement widget provides users with a detailed overview of their stock holdings within the application. It includes information such as stock names, quantities held, current market values, and overall portfolio performance metrics, enabling users to track and manage their investments effectively.\r\nIncluded Content: stock holdings, quantities held, market values, portfolio performance\r\nLink to open, view or navigate: btn://more/my account > stock statement\r\nTool: btn://more/my account > stock statement\r\n\r\nName: Cash Statement\r\nPath: More > My Account > Cash Statement","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":414,"to":425}}}}],["e01a80d3-b5a6-480a-bca7-a52b923db8c0",{"pageContent":"Link to open, view or navigate: btn://more/my account > stock statement\r\nTool: btn://more/my account > stock statement\r\n\r\nName: Cash Statement\r\nPath: More > My Account > Cash Statement\r\nAbout: The Cash Statement widget displays users' cash balances and transactions within the application. It provides details such as current cash balance, transaction history, deposits, withdrawals, and other financial activities, enabling users to monitor their liquidity and financial transactions effectively.\r\nIncluded Content: cash balances, transaction history, deposits, withdrawals, financial activities\r\nLink to open, view or navigate: btn://more/my account > cash statement\r\nTool: btn://more/my account > cash statement\r\n\r\nName: Annual Statement\r\nPath: More > My Account > Annual Statement","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":421,"to":432}}}}],["0e41288c-cb64-427b-977d-85c88820b194",{"pageContent":"Link to open, view or navigate: btn://more/my account > cash statement\r\nTool: btn://more/my account > cash statement\r\n\r\nName: Annual Statement\r\nPath: More > My Account > Annual Statement\r\nAbout: The Annual Statement widget provides users with a comprehensive summary of their financial activities and account performance for the past year within the application. It includes details such as annual earnings, expenses, investment returns, tax information, and other financial metrics, helping users review their financial health and plan for the future effectively.\r\nIncluded Content: financial activities summary, account performance, annual earnings, expenses, investment returns, tax information\r\nLink to open, view or navigate: btn://more/my account > annual statement\r\nTool: btn://more/my account > annual statement\r\n\r\nName: Change Password\r\nPath: More > My Account > Change Password","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":428,"to":439}}}}],["c82c1476-66e8-41b3-b065-d56bad19851c",{"pageContent":"Link to open, view or navigate: btn://more/my account > annual statement\r\nTool: btn://more/my account > annual statement\r\n\r\nName: Change Password\r\nPath: More > My Account > Change Password\r\nAbout: The Change Password widget allows users to securely update their account password within the application. It guides users through the process of entering a new password, verifying the change, and ensuring account security with strong authentication measures.\r\nIncluded Content: update password, enter new password, verify change, ensure account security\r\nLink to open, view or navigate: btn://more/my account > change password\r\nTool: btn://more/my account > change password\r\n\r\nName: Close Account\r\nPath: More > My Account > Close Account","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":435,"to":446}}}}],["58bd7eb5-4e47-4961-9c37-2c30c9daa08a",{"pageContent":"Link to open, view or navigate: btn://more/my account > change password\r\nTool: btn://more/my account > change password\r\n\r\nName: Close Account\r\nPath: More > My Account > Close Account\r\nAbout: The Close Account widget guides users through the process of securely closing their account within the application. It provides instructions for confirming the closure, transferring remaining balances, and completing any necessary steps to ensure account closure is handled smoothly and securely.\r\nIncluded Content: close account, confirm closure, transfer remaining balances, ensure account closure\r\nLink to open, view or navigate: btn://more/my account > close account\r\nTool: btn://more/my account > close account\r\n\r\nName: Cash and Margin\r\nPath: More > Cash and Margin","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":442,"to":453}}}}],["c56fa016-0057-4e7d-a13e-939904325377",{"pageContent":"Link to open, view or navigate: btn://more/my account > close account\r\nTool: btn://more/my account > close account\r\n\r\nName: Cash and Margin\r\nPath: More > Cash and Margin\r\nAbout: The Cash and Margin widget provides users with an overview of their account balances and margin trading capabilities within the application. It displays details such as available cash balances, margin utilization, borrowing limits, and collateral requirements, enabling users to manage their trading activities and leverage effectively.\r\nIncluded Content: account balances overview, margin trading capabilities, available cash balances, margin utilization, borrowing limits\r\nLink to open, view or navigate: btn://more/cash and margin\r\nTool: btn://more/cash and margin\r\n\r\nName: Cash Transfer History\r\nPath: More > Cash and Margin > All History","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":449,"to":460}}}}],["59a52525-24e4-4bda-b2c4-b32725838ea0",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin\r\nTool: btn://more/cash and margin\r\n\r\nName: Cash Transfer History\r\nPath: More > Cash and Margin > All History\r\nAbout: The Cash Transfer History widget displays users' transaction history related to cash transfers within the application. It provides details such as transfer dates, amounts, transaction types (e.g., deposits, withdrawals), and transaction statuses, allowing users to track their financial activities and manage their funds efficiently.\r\nIncluded Content: transaction history, cash transfers, transfer dates, amounts, transaction types, statuses\r\nLink to open, view or navigate: btn://more/cash and margin > all history\r\nTool: btn://more/cash and margin > all history\r\n\r\nName: Add cash account\r\nPath: More > Cash and Margin > Transfer","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":456,"to":467}}}}],["509e666b-6db1-479b-a96b-8e22be991cde",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin > all history\r\nTool: btn://more/cash and margin > all history\r\n\r\nName: Add cash account\r\nPath: More > Cash and Margin > Transfer\r\nAbout: The Add Cash Account widget allows users to securely add a new cash account to their profile within the application. It guides users through entering account details, verifying information, and completing any necessary security measures to ensure seamless integration of additional cash management options.\r\nIncluded Content: add new cash account, enter account details, verify information, complete security measures\r\nLink to open, view or navigate: btn://more/cash and margin > transfer\r\nTool: btn://more/cash and margin > transfer\r\n\r\nName: Quick Transfer\r\nPath: More > Cash and Margin > Transfer >","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":463,"to":474}}}}],["df0afb95-711b-43f6-b5fd-3ad2f3dec81d",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin > transfer\r\nTool: btn://more/cash and margin > transfer\r\n\r\nName: Quick Transfer\r\nPath: More > Cash and Margin > Transfer >\r\nAbout: The Quick Transfer widget enables users to swiftly transfer funds between accounts or make payments within the application. It offers a streamlined process for initiating transfers, specifying amounts, selecting recipients, and confirming transactions, ensuring efficient financial transactions.\r\nIncluded Content: transfer funds, make payments, streamlined process, specify amounts, select recipients\r\nLink to open, view or navigate: btn://more/cash and margin > transfer >\r\nTool: btn://more/cash and margin > transfer >\r\n\r\nName: Local Transfer\r\nPath: More > Cash and Margin > Transfer >","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":470,"to":481}}}}],["74d62fd5-6b86-40db-92f3-29821cbd6232",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin > transfer >\r\nTool: btn://more/cash and margin > transfer >\r\n\r\nName: Local Transfer\r\nPath: More > Cash and Margin > Transfer >\r\nAbout: The Local Transfer widget facilitates users in conducting local fund transfers within the application. It allows users to initiate transfers between accounts or to other users within the same financial institution or network. Users can specify transfer details such as amounts, recipients, and transaction purposes, ensuring convenient and secure local transactions.\r\nIncluded Content: local fund transfers, initiate transfers, specify amounts, recipients, transaction purposes\r\nLink to open, view or navigate: btn://more/cash and margin > transfer >\r\nTool: btn://more/cash and margin > transfer >\r\n\r\nName: Margin Lending\r\nPath: More > Cash and Margin > Margin","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":477,"to":488}}}}],["fcc5f6b4-f5d2-4e1a-a7ef-1a0176314dbc",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin > transfer >\r\nTool: btn://more/cash and margin > transfer >\r\n\r\nName: Margin Lending\r\nPath: More > Cash and Margin > Margin\r\nAbout: The Margin Lending widget in the application allows users to access margin trading capabilities. It provides details such as borrowing limits, interest rates, collateral requirements, and margin utilization. This widget enables users to effectively manage and monitor their leveraged trading activities.\r\nIncluded Content: margin trading capabilities, borrowing limits, interest rates, collateral requirements, leverage management\r\nLink to open, view or navigate: btn://more/cash and margin > margin\r\nTool: btn://more/cash and margin > margin\r\n\r\nName: Apply For Margin\r\nPath: More > Cash and Margin > Margin >","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":484,"to":495}}}}],["71939943-cef0-427d-a83a-d75365462ba8",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin > margin\r\nTool: btn://more/cash and margin > margin\r\n\r\nName: Apply For Margin\r\nPath: More > Cash and Margin > Margin >\r\nAbout: The Apply For Margin widget enables users to apply for margin trading privileges within the application. It guides users through the application process, providing information on eligibility criteria, required documentation, and approval timelines. This widget facilitates access to leverage for trading activities.\r\nIncluded Content: margin trading privileges, application process, eligibility criteria, required documentation\r\nLink to open, view or navigate: btn://more/cash and margin > margin >\r\nTool: btn://more/cash and margin > margin >\r\n\r\nName: Transfers\r\nPath: More > Transfers","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":491,"to":502}}}}],["172627e3-3df4-4675-9b9e-b8bc6ac71757",{"pageContent":"Link to open, view or navigate: btn://more/cash and margin > margin >\r\nTool: btn://more/cash and margin > margin >\r\n\r\nName: Transfers\r\nPath: More > Transfers\r\nAbout: The Transfers widget allows users to manage fund transfers efficiently within the application. It provides options to initiate transfers between accounts, to other users, or to external accounts. Users can specify transfer details such as amounts, recipients, and transaction purposes, ensuring convenient and secure transactions.\r\nIncluded Content: fund transfers, initiate transfers, specify amounts, recipients, transaction purposes\r\nLink to open, view or navigate: btn://more/transfers\r\nTool: btn://more/transfers\r\n\r\nName: Holdings\r\nPath: More > Holdings","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":498,"to":509}}}}],["c4629963-2817-48f7-be98-506fb716ba97",{"pageContent":"Link to open, view or navigate: btn://more/transfers\r\nTool: btn://more/transfers\r\n\r\nName: Holdings\r\nPath: More > Holdings\r\nAbout: The Holdings widget displays users' current holdings of assets within the application. It provides details such as asset names, quantities held, current market values, and overall portfolio performance metrics, allowing users to monitor their investments effectively.\r\nIncluded Content: current holdings, asset names, quantities held, market values, portfolio performance\r\nLink to open, view or navigate: btn://more/holdings\r\nTool: btn://more/holdings\r\n\r\nName: Order List\r\nPath: More > Orders\r\nAbout: The Order List widget presents users with a detailed view of their current orders within the application. It includes information such as order types (e.g., market, limit), asset names, quantities, prices, and order statuses (e.g., pending, filled). This allows users to manage their trading activities efficiently by tracking and adjusting their orders as needed.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":505,"to":517}}}}],["e7a01f69-693b-42a4-9818-563949b6406d",{"pageContent":"Included Content: current orders, order types, asset names, quantities, prices, order statuses\r\nLink to open, view or navigate: btn://more/orders\r\nTool: btn://more/orders\r\n\r\nName: Saved Orders\r\nPath: More > Orders > Saved\r\nAbout: The Saved Orders widget allows users to store and manage their saved trading orders within the application. It enables users to view details such as order types (e.g., market, limit), asset names, quantities, prices, and order statuses. This functionality helps users execute trades quickly and efficiently by accessing pre-saved order parameters.\r\nIncluded Content: saved trading orders, order types, asset names, quantities, prices, order statuses\r\nLink to open, view or navigate: btn://more/orders > saved\r\nTool: btn://more/orders > saved\r\n\r\nName: Scheduled Orders\r\nPath: More > Orders > Scheduled","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":518,"to":530}}}}],["f90e0ba2-87df-4724-ac0e-024123a0f578",{"pageContent":"Link to open, view or navigate: btn://more/orders > saved\r\nTool: btn://more/orders > saved\r\n\r\nName: Scheduled Orders\r\nPath: More > Orders > Scheduled\r\nAbout: The Scheduled Orders widget enables users to set and manage scheduled trading orders within the application. It allows users to specify details such as order types (e.g., market, limit), asset names, quantities, prices, and execution dates. This feature helps users automate their trading strategies and execute orders at predetermined times.\r\nIncluded Content: scheduled trading orders, order types, asset names, quantities, prices, execution dates\r\nLink to open, view or navigate: btn://more/orders > scheduled\r\nTool: btn://more/orders > scheduled\r\n\r\nName: Order Search\r\nPath: More > Order Search","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":526,"to":537}}}}],["f97832eb-5fb5-4263-8459-fb9672acff32",{"pageContent":"Link to open, view or navigate: btn://more/orders > scheduled\r\nTool: btn://more/orders > scheduled\r\n\r\nName: Order Search\r\nPath: More > Order Search\r\nAbout: The Order Search widget allows users to search and retrieve specific trading orders within the application. It provides functionalities to filter orders based on criteria such as order types (e.g., market, limit), asset names, quantities, prices, and order statuses. This feature enables users to efficiently track and manage their trading activities.\r\nIncluded Content: search trading orders, filter criteria, order types, asset names, quantities, prices, order statuses\r\nLink to open, view or navigate: btn://more/order search\r\nTool: btn://more/order search\r\n\r\nName: Conditional Orders\r\nPath: More > Order Search > Conditional","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":533,"to":544}}}}],["a68e366b-76eb-45ba-bfe4-dfa4b847a316",{"pageContent":"Link to open, view or navigate: btn://more/order search\r\nTool: btn://more/order search\r\n\r\nName: Conditional Orders\r\nPath: More > Order Search > Conditional\r\nAbout: The Conditional Orders widget enables users to set automated conditions for executing trading orders based on predefined criteria within the application. It allows users to specify conditions such as price triggers, time frames, and order types (e.g., stop-loss, take-profit), providing flexibility and automation in managing investment positions.\r\nIncluded Content: automated conditions, trading orders, predefined criteria, price triggers, time frames, order types\r\nLink to open, view or navigate: btn://more/order search > conditional\r\nTool: btn://more/order search > conditional\r\n\r\nName: Tradable Orders\r\nPath: More > Order Search > Tradable\r\nAbout: desctiption about the widget\r\nIncluded Content: included contents seperated each by commas\r\nLink to open, view or navigate: btn://more/order search > tradable","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":540,"to":554}}}}],["0743bcd1-1123-4dc1-9311-33e1b3c42033",{"pageContent":"About: desctiption about the widget\r\nIncluded Content: included contents seperated each by commas\r\nLink to open, view or navigate: btn://more/order search > tradable\r\nTool: btn://more/order search > tradable\r\n\r\nName: Gain and Loss\r\nPath: More > Gain and Loss\r\nAbout: The Gain and Loss widget provides users with a summary of their investment performance within the application. It displays details such as realized and unrealized gains or losses, overall portfolio performance metrics, and historical trends. This widget helps users track their investment profitability and make informed decisions.\r\nIncluded Content: investment performance summary, realized gains, unrealized losses, portfolio performance metrics\r\nLink to open, view or navigate: btn://more/gain and loss\r\nTool: btn://more/gain and loss\r\n\r\nName: Mutual Funds\r\nPath: More > Mutual Funds","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":552,"to":565}}}}],["a3364755-2846-4f79-b9f0-46ff88a92804",{"pageContent":"Link to open, view or navigate: btn://more/gain and loss\r\nTool: btn://more/gain and loss\r\n\r\nName: Mutual Funds\r\nPath: More > Mutual Funds\r\nAbout: The Mutual Funds widget allows users to view and manage their mutual fund investments within the application. It provides details such as fund names, NAV (Net Asset Value), daily performance, fund manager details, and investment objectives. This widget helps users monitor their mutual fund portfolio and make informed investment decisions.\r\nIncluded Content: mutual fund investments, fund names, NAV, daily performance, fund manager details\r\nLink to open, view or navigate: btn://more/mutual funds\r\nTool: btn://more/mutual funds\r\n\r\nName: Update Risk Profile\r\nPath: More > Mutual Funds > Fund List","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":561,"to":572}}}}],["c7333e2c-bdd8-437f-b2b0-99329fe5f885",{"pageContent":"Link to open, view or navigate: btn://more/mutual funds\r\nTool: btn://more/mutual funds\r\n\r\nName: Update Risk Profile\r\nPath: More > Mutual Funds > Fund List\r\nAbout: The Update Risk Profile widget allows users to revise and update their risk assessment and investment preferences within the application. It guides users through the process of evaluating risk tolerance, investment goals, and time horizon, ensuring that their investment strategies align with current financial objectives.\r\nIncluded Content: revise risk assessment, update investment preferences, evaluate risk tolerance, investment goals\r\nLink to open, view or navigate: btn://more/mutual funds > fund list\r\nTool: btn://more/mutual funds > fund list\r\n\r\nName: MF Transactions\r\nPath: More > Mutual Funds > Transactions","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":568,"to":579}}}}],["585b7484-1b58-4f5c-99b6-930e2574f3c6",{"pageContent":"Link to open, view or navigate: btn://more/mutual funds > fund list\r\nTool: btn://more/mutual funds > fund list\r\n\r\nName: MF Transactions\r\nPath: More > Mutual Funds > Transactions\r\nAbout: The MF Transactions widget enables users to view and manage their mutual fund transactions within the application. It provides details such as transaction types (e.g., purchase, redemption), fund names, transaction dates, amounts, and transaction statuses. This widget facilitates tracking and monitoring of mutual fund activities for effective portfolio management.\r\nIncluded Content: mutual fund transactions, transaction types, fund names, transaction dates, amounts\r\nLink to open, view or navigate: btn://more/mutual funds > transactions\r\nTool: btn://more/mutual funds > transactions\r\n\r\nName: MF Holdings\r\nPath: More > Mutual Funds > Holdings","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":575,"to":586}}}}],["b8a3b1b9-94ba-43e0-b88b-cfaeb11a48cc",{"pageContent":"Link to open, view or navigate: btn://more/mutual funds > transactions\r\nTool: btn://more/mutual funds > transactions\r\n\r\nName: MF Holdings\r\nPath: More > Mutual Funds > Holdings\r\nAbout: The MF Holdings widget displays users' current holdings of mutual funds within the application. It provides details such as fund names, quantities held, NAV (Net Asset Value), and overall portfolio allocation. This widget helps users monitor their mutual fund investments and assess their portfolio diversification.\r\nIncluded Content: current mutual fund holdings, fund names, quantities held, NAV, portfolio allocation\r\nLink to open, view or navigate: btn://more/mutual funds > holdings\r\nTool: btn://more/mutual funds > holdings\r\n\r\nName: Alerts\r\nPath: More > Alerts Management","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":582,"to":593}}}}],["d715c9c0-a334-4c53-a591-2acf875e5c9c",{"pageContent":"Link to open, view or navigate: btn://more/mutual funds > holdings\r\nTool: btn://more/mutual funds > holdings\r\n\r\nName: Alerts\r\nPath: More > Alerts Management\r\nAbout: The Alerts widget allows users to set and manage personalized alerts within the application. It enables users to create alerts based on criteria such as price movements, news updates, or specific events related to their investments. This widget helps users stay informed and take timely actions based on market developments.\r\nIncluded Content: personalized alerts, set alerts, price movements, news updates, investment events\r\nLink to open, view or navigate: btn://more/alerts management\r\nTool: btn://more/alerts management\r\n\r\nName: Add New Alert\r\nPath: More > Alerts Management","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":589,"to":600}}}}],["913fa927-d016-4c70-9d66-9db8fd491c3c",{"pageContent":"Link to open, view or navigate: btn://more/alerts management\r\nTool: btn://more/alerts management\r\n\r\nName: Add New Alert\r\nPath: More > Alerts Management\r\nAbout: The Add New Alert widget enables users to create customized alerts within the application. It guides users through the process of setting alert criteria such as price thresholds, news updates, or specific events related to their investments. This feature helps users stay informed and manage their portfolios effectively.\r\nIncluded Content: create customized alerts, set alert criteria, price thresholds, news updates\r\nLink to open, view or navigate: btn://more/alerts management\r\nTool: btn://more/alerts management\r\n\r\nName: One login\r\nPath: More > One Login\r\nAbout: desctiption about the widget\r\nIncluded Content: included contents seperated each by commas\r\nLink to open, view or navigate: btn://more/one login\r\nTool: btn://more/one login\r\n\r\nName: Marginable symbols\r\nPath: More > Marginable Symbols","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":596,"to":614}}}}],["aa25eeb2-93d2-40fc-ab36-ed8f7eec7708",{"pageContent":"Link to open, view or navigate: btn://more/one login\r\nTool: btn://more/one login\r\n\r\nName: Marginable symbols\r\nPath: More > Marginable Symbols\r\nAbout: The Marginable Symbols widget provides users with a list of securities eligible for margin trading within the application. It displays details such as symbol names, margin requirements, current prices, and trading statuses. This widget helps users identify and select securities suitable for leveraging their trading activities.\r\nIncluded Content: margin trading eligible securities, symbol names, margin requirements, current prices, trading statuses\r\nLink to open, view or navigate: btn://more/marginable symbols\r\nTool: btn://more/marginable symbols\r\n\r\nName: IPO Symbol List\r\nPath: More > IPO","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":610,"to":621}}}}],["df21dba3-807f-4a4d-928d-cea627e2757b",{"pageContent":"Link to open, view or navigate: btn://more/marginable symbols\r\nTool: btn://more/marginable symbols\r\n\r\nName: IPO Symbol List\r\nPath: More > IPO\r\nAbout: The IPO Symbol List widget displays a comprehensive list of symbols for initial public offerings (IPOs) available for trading within the application. It includes details such as IPO company names, symbol tickers, offering prices, and trading statuses. This widget helps users track and participate in IPOs effectively.\r\nIncluded Content: IPO symbol list, IPO company names, symbol tickers, offering prices, trading statuses\r\nLink to open, view or navigate: btn://more/ipo\r\nTool: btn://more/ipo\r\n\r\nName: IPO Subscription Requests\r\nPath: More > IPO > subscription requests","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":617,"to":628}}}}],["ad74b4ec-5a9d-422c-bac0-c413a7d98297",{"pageContent":"Link to open, view or navigate: btn://more/ipo\r\nTool: btn://more/ipo\r\n\r\nName: IPO Subscription Requests\r\nPath: More > IPO > subscription requests\r\nAbout: The IPO Subscription Requests widget allows users to manage their subscription requests for initial public offerings (IPOs) within the application. It enables users to view details such as subscribed quantities, allotment statuses, payment instructions, and subscription deadlines. This widget facilitates efficient management of IPO participation.\r\nIncluded Content: manage IPO subscriptions, subscribed quantities, allotment statuses, payment instructions\r\nLink to open, view or navigate: btn://more/ipo > subscription requests\r\nTool: btn://more/ipo > subscription requests\r\n\r\nName: All IPO Orders\r\nPath: More > IPO > All IPO orders","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":624,"to":635}}}}],["a1b9de14-8be2-4a25-97c9-5a5f3cb40be2",{"pageContent":"Link to open, view or navigate: btn://more/ipo > subscription requests\r\nTool: btn://more/ipo > subscription requests\r\n\r\nName: All IPO Orders\r\nPath: More > IPO > All IPO orders\r\nAbout: The All IPO Orders widget provides users with a comprehensive view of all their orders placed for initial public offerings (IPOs) within the application. It includes details such as order types (e.g., market, limit), subscribed quantities, order statuses (e.g., pending, filled), and transaction histories. This widget helps users track and manage their IPO orders effectively.\r\nIncluded Content: IPO orders overview, order types, subscribed quantities, order statuses, transaction histories\r\nLink to open, view or navigate: btn://more/ipo > all ipo orders\r\nTool: btn://more/ipo > all ipo orders\r\n\r\nName: IPO Symbol Past Performance\r\nPath: More > IPO > IPO symbol past performance","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":631,"to":642}}}}],["8f65f1c4-4acf-4a6a-9b24-4a6624b5c061",{"pageContent":"Link to open, view or navigate: btn://more/ipo > all ipo orders\r\nTool: btn://more/ipo > all ipo orders\r\n\r\nName: IPO Symbol Past Performance\r\nPath: More > IPO > IPO symbol past performance\r\nAbout: The IPO Symbol Past Performance widget provides users with historical performance data of symbols from initial public offerings (IPOs) within the application. It displays details such as past trading prices, volume trends, price fluctuations since IPO launch, and key performance indicators. This widget helps users analyze the historical performance of IPOs and make informed investment decisions.\r\nIncluded Content: historical performance data, IPO symbols, trading prices, volume trends, price fluctuations\r\nLink to open, view or navigate: btn://more/ipo > ipo symbol past performance\r\nTool: btn://more/ipo > ipo symbol past performance\r\n\r\nName: Help Center\r\nPath: More > Help and Support","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":638,"to":649}}}}],["21591684-82f0-4631-bc01-2f40200e1f50",{"pageContent":"Link to open, view or navigate: btn://more/ipo > ipo symbol past performance\r\nTool: btn://more/ipo > ipo symbol past performance\r\n\r\nName: Help Center\r\nPath: More > Help and Support\r\nAbout: The Help Center widget serves as a comprehensive resource for users within the application. It provides access to FAQs, guides, troubleshooting steps, and customer support contact information. Users can find answers to common queries and receive assistance for any issues they encounter while using the application.\r\nIncluded Content: FAQs, guides, troubleshooting, customer support\r\nLink to open, view or navigate: btn://more/help and support\r\nTool: btn://more/help and support\r\n\r\nName: ANB Lite\r\nPath: More > Trading Configuration\r\nAbout: desctiption about the widget\r\nIncluded Content: included contents seperated each by commas\r\nLink to open, view or navigate: btn://more/trading configuration\r\nTool: btn://more/trading configuration\r\n\r\nName: Theme Change\r\nPath: More > Appearance","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":645,"to":663}}}}],["7f998003-a165-45a3-bd6d-8b3d8f2ef493",{"pageContent":"Link to open, view or navigate: btn://more/trading configuration\r\nTool: btn://more/trading configuration\r\n\r\nName: Theme Change\r\nPath: More > Appearance\r\nAbout: The Theme Change widget allows users to customize the visual appearance of the application interface. It provides options to switch between different themes, such as light or dark modes, and adjust color schemes to suit personal preferences. This widget enhances user experience by offering flexibility in the application's visual presentation.\r\nIncluded Content: customize interface themes, switch themes, light mode, dark mode\r\nLink to open, view or navigate: btn://more/appearance\r\nTool: btn://more/appearance\r\n\r\nName: App Settings\r\nPath: More > App Settings","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":659,"to":670}}}}],["d010d376-4184-4c50-b1c3-1f09c679b1c6",{"pageContent":"Link to open, view or navigate: btn://more/appearance\r\nTool: btn://more/appearance\r\n\r\nName: App Settings\r\nPath: More > App Settings\r\nAbout: The App Settings widget enables users to manage and customize various application settings according to their preferences. It provides options to adjust account preferences, notification settings, security features, and other personalization options. This widget ensures users can tailor their experience to meet their specific needs and enhance usability.\r\nIncluded Content: manage application settings, customize preferences, adjust notifications, enhance usability\r\nLink to open, view or navigate: btn://more/app settings\r\nTool: btn://more/app settings\r\n\r\nName: Language Change\r\nPath: More > App Settings > Application Settings","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":666,"to":677}}}}],["837eb27b-6114-4143-bd64-73c774bd8fc6",{"pageContent":"Link to open, view or navigate: btn://more/app settings\r\nTool: btn://more/app settings\r\n\r\nName: Language Change\r\nPath: More > App Settings > Application Settings\r\nAbout: The Language Change widget allows users to switch the application's language to their preferred language. It provides options to select from a list of supported languages, ensuring that users can interact with the application in their preferred language for a better user experience.\r\nIncluded Content: switch application language, select preferred language\r\nLink to open, view or navigate: btn://more/app settings > application settings\r\nTool: btn://more/app settings > application settings\r\n\r\nName: Clear App Cache\r\nPath: More > App Settings > Troubleshooting","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":673,"to":684}}}}],["3183afdc-b9ec-4eda-8089-605057537484",{"pageContent":"Tool: btn://more/app settings > application settings\r\n\r\nName: Clear App Cache\r\nPath: More > App Settings > Troubleshooting\r\nAbout: The Clear App Cache widget allows users to delete temporary files and data stored by the application. It helps improve app performance and resolve issues related to cached data. Users can clear cache selectively or completely, ensuring smooth operation of the application.\r\nIncluded Content: delete temporary files, improve app performance\r\nLink to open, view or navigate: btn://more/app settings > troubleshooting\r\nTool: btn://more/app settings > troubleshooting\r\n\r\nName: Disclaimer/T&C/Privacy policy\r\nPath: More\r\nAbout: The Disclaimer/T&C/Privacy Policy widget provides users with access to legal documents governing the use of the application. It includes terms of service, privacy policies, disclaimers, and other important agreements. Users can review these documents to understand their rights and responsibilities while using the application.","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":681,"to":692}}}}],["8db9ecdb-7254-4020-a404-e994ef033ae2",{"pageContent":"Included Content: terms of service, privacy policies, disclaimers\r\nLink to open, view or navigate: btn://more\r\nTool: btn://more","metadata":{"source":"./langChainTrainData.txt","loc":{"lines":{"from":693,"to":695}}}}]],{"0":"08339ac0-dedb-4892-af68-1f4af5d93691","1":"bfcde912-6f54-4fd6-972a-860f2b618886","2":"37279aa5-a136-4f32-a479-a719670fb084","3":"779eecb9-34c1-4cd5-8001-54ff48db83af","4":"83cf37f8-433a-4f41-8254-96dd696a63b8","5":"330f2ee2-89e5-421e-955f-ecaff9644181","6":"7203b7fe-446b-4e4b-a1ba-ba4e94b526e3","7":"f89481a7-4a22-4a2e-bbd9-0c5abe2d692d","8":"5d2906d0-6661-477c-89ed-a9068a377e0d","9":"4a527bb9-61ae-4498-abf0-997290e5a194","10":"4cb3b8c0-0aaa-4490-a386-f8014cf809ee","11":"11987310-4b63-4e84-a339-252d4b4ec700","12":"0440bed3-18c9-40ed-8afe-3d37fdb65a03","13":"ab32b031-63a1-4617-8051-107ab2906edf","14":"5c0bc7cd-8690-4f91-bb72-4a22607cd25e","15":"19c756a7-d068-46af-9c34-2a49b76d35bf","16":"0820c89e-90bf-46d9-8a4c-0c3c17df0cf4","17":"a68fda8d-22fa-41e4-9184-2566ccfad0a8","18":"2f50da48-36ca-45ec-bd8e-c9501e175b8c","19":"242f3c19-5d17-46ee-b74d-7bf8fef10719","20":"c2df620f-27a0-4a06-ab94-e2610d7ea920","21":"8f2222ba-c3a4-4d56-957a-a6f14c8cf497","22":"346b7136-18d6-4bf1-bfcb-63da8efaf918","23":"506cdd1e-c6de-4450-8178-c7e24e36cf12","24":"d951443b-b8ae-45f1-9d7f-4b3d3f138d29","25":"00945749-fa31-4ac5-a3d0-57085773820a","26":"8650e9c4-c38b-48be-afb8-e9fe1e3c9071","27":"039483b2-b38b-4dba-a3b3-73e5636c358a","28":"8ed61a4a-01a3-4a42-bf20-050d1eff5e8a","29":"1def5eb8-2646-4a7c-9b1d-7429547d0c02","30":"248e1461-afb9-4c77-a775-b7b4f0da32ca","31":"d22d34de-9b8b-4f25-ab32-0f60c5d06132","32":"e74cb8b6-e020-462e-bde3-310ab0cfd07b","33":"8b42d11f-63cf-431c-a74d-8a1ddd02a50c","34":"30a3622e-0204-4090-982a-3af00c560710","35":"d843da07-f958-4acd-b013-50847a1888eb","36":"e6191a67-d274-4f67-8c6d-92ada613a146","37":"642a94a3-6eef-4e87-aa8a-0446a66dd572","38":"6a3b9298-c7d1-4a3a-a82b-46bfabf5d120","39":"06e383a5-4717-4ae6-a794-d756feec4284","40":"d1327b7c-3e8b-4c1c-974a-781861998950","41":"06203f8f-c5c2-42f6-8a56-7b9301abf6a2","42":"e01a80d3-b5a6-480a-bca7-a52b923db8c0","43":"0e41288c-cb64-427b-977d-85c88820b194","44":"c82c1476-66e8-41b3-b065-d56bad19851c","45":"58bd7eb5-4e47-4961-9c37-2c30c9daa08a","46":"c56fa016-0057-4e7d-a13e-939904325377","47":"59a52525-24e4-4bda-b2c4-b32725838ea0","48":"509e666b-6db1-479b-a96b-8e22be991cde","49":"df0afb95-711b-43f6-b5fd-3ad2f3dec81d","50":"74d62fd5-6b86-40db-92f3-29821cbd6232","51":"fcc5f6b4-f5d2-4e1a-a7ef-1a0176314dbc","52":"71939943-cef0-427d-a83a-d75365462ba8","53":"172627e3-3df4-4675-9b9e-b8bc6ac71757","54":"c4629963-2817-48f7-be98-506fb716ba97","55":"e7a01f69-693b-42a4-9818-563949b6406d","56":"f90e0ba2-87df-4724-ac0e-024123a0f578","57":"f97832eb-5fb5-4263-8459-fb9672acff32","58":"a68e366b-76eb-45ba-bfe4-dfa4b847a316","59":"0743bcd1-1123-4dc1-9311-33e1b3c42033","60":"a3364755-2846-4f79-b9f0-46ff88a92804","61":"c7333e2c-bdd8-437f-b2b0-99329fe5f885","62":"585b7484-1b58-4f5c-99b6-930e2574f3c6","63":"b8a3b1b9-94ba-43e0-b88b-cfaeb11a48cc","64":"d715c9c0-a334-4c53-a591-2acf875e5c9c","65":"913fa927-d016-4c70-9d66-9db8fd491c3c","66":"aa25eeb2-93d2-40fc-ab36-ed8f7eec7708","67":"df21dba3-807f-4a4d-928d-cea627e2757b","68":"ad74b4ec-5a9d-422c-bac0-c413a7d98297","69":"a1b9de14-8be2-4a25-97c9-5a5f3cb40be2","70":"8f65f1c4-4acf-4a6a-9b24-4a6624b5c061","71":"21591684-82f0-4631-bc01-2f40200e1f50","72":"7f998003-a165-45a3-bd6d-8b3d8f2ef493","73":"d010d376-4184-4c50-b1c3-1f09c679b1c6","74":"837eb27b-6114-4143-bd64-73c774bd8fc6","75":"3183afdc-b9ec-4eda-8089-605057537484","76":"8db9ecdb-7254-4020-a404-e994ef033ae2"}]